# determinEnchantTitleMethodで決定した判断条件（標準出力されたコード）を、
# ここへハードコーディングして関数にする

import numpy as np

# 200x15の画像を1次元化した配列から、
# エンチャントの本のタイトルを得る
def judge_title(img: np.array) -> str:
    # [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
    #  24 25 26 27 28 29 30 31 32 33 34 35 36 37 38]
    # 1007 (20:19)
    if img[1007]:
        # [ 2  3  5  6  7 10 16 17 18 19 20 22 25 26 29 31 32 35 38]
        # 220 (10:9)
        if img[220]:
            # [ 3  6 10 20 22 25 29 32 38]
            # 221 (5:4)
            if img[221]:
                # [25 29 32 38]
                # 7 (2:2)
                if img[7]:
                    # [25 32]
                    # 29 (1:1)
                    if img[29]:
                        # [25]
                        return "忠誠"
                    else:
                        # [32]
                        return "火属性"
                else:
                    # [29 38]
                    # 2 (1:1)
                    if img[2]:
                        # [29]
                        return "爆発耐性"
                    else:
                        # [38]
                        return "重撃"
            else:
                # [ 3  6 10 20 22]
                # 19 (3:2)
                if img[19]:
                    # [ 6 10]
                    # 0 (1:1)
                    if img[0]:
                        # [6]
                        return "激流"
                    else:
                        # [10]
                        return "氷渡り"
                else:
                    # [ 3 20 22]
                    # 20 (2:1)
                    if img[20]:
                        # [3]
                        return "火炎耐性"
                    else:
                        # [20 22]
                        # 27 (1:1)
                        if img[27]:
                            # [22]
                            return "宝釣り"
                        else:
                            # [20]
                            return "束縛の呪い"
        else:
            # [ 2  5  7 16 17 18 19 26 31 35]
            # 264 (5:5)
            if img[264]:
                # [16 17 18 19 26]
                # 46 (3:2)
                if img[46]:
                    # [16 17]
                    # 39 (1:1)
                    if img[39]:
                        # [16]
                        return "水生特効"
                    else:
                        # [17]
                        return "水中呼吸"
                else:
                    # [18 19 26]
                    # 38 (2:1)
                    if img[38]:
                        # [18]
                        return "水中採掘"
                    else:
                        # [19 26]
                        # 7 (1:1)
                        if img[7]:
                            # [19]
                            return "水中歩行"
                        else:
                            # [26]
                            return "飛び道具耐性"
            else:
                # [ 2  5  7 31 35]
                # 7 (3:2)
                if img[7]:
                    # [ 7 35]
                    # 21 (1:1)
                    if img[21]:
                        # [35]
                        return "虫特効"
                    else:
                        # [7]
                        return "幸運"
                else:
                    # [ 2  5 31]
                    # 42 (2:1)
                    if img[42]:
                        # [2]
                        return "入れ食い"
                    else:
                        # [ 5 31]
                        # 203 (1:1)
                        if img[203]:
                            # [5]
                            return "貫通"
                        else:
                            # [31]
                            return "パンチ"
    else:
        # [ 0  1  4  8  9 11 12 13 14 15 21 23 24 27 28 30 33 34 36 37]
        # 404 (10:10)
        if img[404]:
            # [ 1  8  9 11 23 24 30 34 36 37]
            # 218 (5:5)
            if img[218]:
                # [ 8 11 30 34 36]
                # 4 (3:2)
                if img[4]:
                    # [11 36]
                    # 10 (1:1)
                    if img[10]:
                        # [36]
                        return "落下耐性"
                    else:
                        # [11]
                        return "射撃ダメージ増加"
                else:
                    # [ 8 30 34]
                    # 2 (2:1)
                    if img[2]:
                        # [30]
                        return "範囲ダメージ増加"
                    else:
                        # [ 8 34]
                        # 3 (1:1)
                        if img[3]:
                            # [34]
                            return "無限"
                        else:
                            # [8]
                            return "高速装填"
            else:
                # [ 1  9 23 24 37]
                # 10 (3:2)
                if img[10]:
                    # [1 9]
                    # 3 (1:1)
                    if img[3]:
                        # [1]
                        return "棘の鎧"
                    else:
                        # [9]
                        return "効率強化"
                else:
                    # [23 24 37]
                    # 9 (2:1)
                    if img[9]:
                        # [37]
                        return "防具貫通"
                    else:
                        # [23 24]
                        # 74 (1:1)
                        if img[74]:
                            # [24]
                            return "ダメージ増加"
                        else:
                            # [23]
                            return "ダメージ軽減"
        else:
            # [ 0  4 12 13 14 15 21 27 28 33]
            # 412 (5:5)
            if img[412]:
                # [ 4 12 13 14 21]
                # 204 (3:2)
                if img[204]:
                    # [14 21]
                    # 12 (1:1)
                    if img[12]:
                        # [21]
                        return "耐久力"
                    else:
                        # [14]
                        return "召雷"
                else:
                    # [ 4 12 13]
                    # 1 (2:1)
                    if img[1]:
                        # [13]
                        return "消滅の呪い"
                    else:
                        # [ 4 12]
                        # 2 (1:1)
                        if img[2]:
                            # [4]
                            return "拡散"
                        else:
                            # [12]
                            return "修繕"
            else:
                # [ 0 15 27 28 33]
                # 93 (3:2)
                if img[93]:
                    # [ 0 27]
                    # 74 (1:1)
                    if img[74]:
                        # [27]
                        return "ドロップ増加"
                    else:
                        # [0]
                        return "アンデッド特効"
                else:
                    # [15 28 33]
                    # 408 (2:1)
                    if img[408]:
                        # [28]
                        return "ノックバック"
                    else:
                        # [15 33]
                        # 420 (1:1)
                        if img[420]:
                            # [33]
                            return "フレイム"
                        else:
                            # [15]
                            return "シルクタッチ"
